openfoam_container/simulation/newtonian/actual/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.69e-8;  // Cmu^0.75 * k^1.5 / L

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.69e-8;
    }

    fixedWalls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    simetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}