openfoam_container/simulation/newtonian/actual/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.41e-6;  // (0.05 * U)^2 avec U = -0.02375 m/s

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.41e-6;
    }

    fixedWalls
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    simetry
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }
}